; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-5nodes-1000size-4degree-100mindistance-2trucks-6packages-1111seed

(define (problem transport-three-cities-sequential-5nodes-1000size-4degree-100mindistance-2trucks-6packages-1111seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 352,783 -> 222,202
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 60)
  ; 222,202 -> 352,783
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 60)
  ; 657,145 -> 222,202
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 44)
  ; 222,202 -> 657,145
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 44)
  ; 372,457 -> 222,202
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 30)
  ; 222,202 -> 372,457
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 30)
  ; 372,457 -> 352,783
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 33)
  ; 352,783 -> 372,457
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 33)
  ; 372,457 -> 657,145
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 43)
  ; 657,145 -> 372,457
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 43)
  ; 85,745 -> 222,202
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 56)
  ; 222,202 -> 85,745
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 56)
  ; 85,745 -> 352,783
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 27)
  ; 352,783 -> 85,745
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 27)
  ; 85,745 -> 372,457
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 41)
  ; 372,457 -> 85,745
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 41)
  ; 2905,614 -> 2516,974
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 53)
  ; 2516,974 -> 2905,614
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 53)
  ; 2346,674 -> 2516,974
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 35)
  ; 2516,974 -> 2346,674
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 35)
  ; 2346,674 -> 2191,95
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 60)
  ; 2191,95 -> 2346,674
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 60)
  ; 2346,674 -> 2905,614
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 57)
  ; 2905,614 -> 2346,674
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 57)
  ; 2699,109 -> 2191,95
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 51)
  ; 2191,95 -> 2699,109
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 51)
  ; 2699,109 -> 2905,614
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 55)
  ; 2905,614 -> 2699,109
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 55)
  ; 1490,2293 -> 1042,2380
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 46)
  ; 1042,2380 -> 1490,2293
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 46)
  ; 1355,2894 -> 1042,2380
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 61)
  ; 1042,2380 -> 1355,2894
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 61)
  ; 1319,2223 -> 1042,2380
  (road city-3-loc-4 city-3-loc-1)
  (= (road-length city-3-loc-4 city-3-loc-1) 32)
  ; 1042,2380 -> 1319,2223
  (road city-3-loc-1 city-3-loc-4)
  (= (road-length city-3-loc-1 city-3-loc-4) 32)
  ; 1319,2223 -> 1490,2293
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 19)
  ; 1490,2293 -> 1319,2223
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 19)
  ; 1128,2650 -> 1042,2380
  (road city-3-loc-5 city-3-loc-1)
  (= (road-length city-3-loc-5 city-3-loc-1) 29)
  ; 1042,2380 -> 1128,2650
  (road city-3-loc-1 city-3-loc-5)
  (= (road-length city-3-loc-1 city-3-loc-5) 29)
  ; 1128,2650 -> 1490,2293
  (road city-3-loc-5 city-3-loc-2)
  (= (road-length city-3-loc-5 city-3-loc-2) 51)
  ; 1490,2293 -> 1128,2650
  (road city-3-loc-2 city-3-loc-5)
  (= (road-length city-3-loc-2 city-3-loc-5) 51)
  ; 1128,2650 -> 1355,2894
  (road city-3-loc-5 city-3-loc-3)
  (= (road-length city-3-loc-5 city-3-loc-3) 34)
  ; 1355,2894 -> 1128,2650
  (road city-3-loc-3 city-3-loc-5)
  (= (road-length city-3-loc-3 city-3-loc-5) 34)
  ; 1128,2650 -> 1319,2223
  (road city-3-loc-5 city-3-loc-4)
  (= (road-length city-3-loc-5 city-3-loc-4) 47)
  ; 1319,2223 -> 1128,2650
  (road city-3-loc-4 city-3-loc-5)
  (= (road-length city-3-loc-4 city-3-loc-5) 47)
  ; 657,145 <-> 2191,95
  (road city-1-loc-3 city-2-loc-2)
  (= (road-length city-1-loc-3 city-2-loc-2) 154)
  (road city-2-loc-2 city-1-loc-3)
  (= (road-length city-2-loc-2 city-1-loc-3) 154)
  (road city-1-loc-3 city-3-loc-2)
  (= (road-length city-1-loc-3 city-3-loc-2) 154)
  (road city-3-loc-2 city-1-loc-3)
  (= (road-length city-3-loc-2 city-1-loc-3) 154)
  (road city-2-loc-3 city-3-loc-4)
  (= (road-length city-2-loc-3 city-3-loc-4) 177)
  (road city-3-loc-4 city-2-loc-3)
  (= (road-length city-3-loc-4 city-2-loc-3) 177)
  (at package-1 city-3-loc-5)
  (at package-2 city-2-loc-3)
  (at package-3 city-2-loc-1)
  (at package-4 city-2-loc-5)
  (at package-5 city-1-loc-1)
  (at package-6 city-2-loc-3)
  (at truck-1 city-1-loc-2)
  (capacity truck-1 capacity-3)
  (at truck-2 city-1-loc-5)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-3-loc-1)
  (at package-2 city-1-loc-5)
  (at package-3 city-3-loc-2)
  (at package-4 city-2-loc-3)
  (at package-5 city-1-loc-3)
  (at package-6 city-3-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 6
2. (pick-up truck-1 city-1-loc-1 package-5 capacity-2 capacity-3)
   deleted: (at package-5 city-1-loc-1) (capacity truck-1 capacity-3)
   added: (in package-5 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 6
3. (drive truck-1 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-3)
   goals met: 0 of 6
4. (drop truck-1 city-1-loc-3 package-5 capacity-2 capacity-3)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-2)
   added: (at package-5 city-1-loc-3) (capacity truck-1 capacity-3)
   goals met: 1 of 6
5. (drive truck-1 city-1-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 1 of 6
6. (drive truck-1 city-2-loc-2 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-5)
   goals met: 1 of 6
7. (pick-up truck-1 city-2-loc-5 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-2-loc-5) (capacity truck-1 capacity-3)
   added: (in package-4 truck-1) (capacity truck-1 capacity-2)
   goals met: 1 of 6
8. (drive truck-1 city-2-loc-5 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-3)
   goals met: 1 of 6
9. (pick-up truck-1 city-2-loc-3 package-6 capacity-1 capacity-2)
   deleted: (at package-6 city-2-loc-3) (capacity truck-1 capacity-2)
   added: (in package-6 truck-1) (capacity truck-1 capacity-1)
   goals met: 1 of 6
10. (pick-up truck-1 city-2-loc-3 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-2-loc-3) (capacity truck-1 capacity-1)
   added: (in package-2 truck-1) (capacity truck-1 capacity-0)
   goals met: 1 of 6
11. (drop truck-1 city-2-loc-3 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-0)
   added: (at package-4 city-2-loc-3) (capacity truck-1 capacity-1)
   goals met: 2 of 6
12. (drive truck-1 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-1)
   goals met: 2 of 6
13. (pick-up truck-1 city-2-loc-1 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-2-loc-1) (capacity truck-1 capacity-1)
   added: (in package-3 truck-1) (capacity truck-1 capacity-0)
   goals met: 2 of 6
14. (drive truck-1 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 2 of 6
15. (drive truck-1 city-2-loc-3 city-3-loc-4)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-3-loc-4)
   goals met: 2 of 6
16. (drive truck-1 city-3-loc-4 city-3-loc-5)
   deleted: (at truck-1 city-3-loc-4)
   added: (at truck-1 city-3-loc-5)
   goals met: 2 of 6
17. (drop truck-1 city-3-loc-5 package-6 capacity-0 capacity-1)
   deleted: (in package-6 truck-1) (capacity truck-1 capacity-0)
   added: (at package-6 city-3-loc-5) (capacity truck-1 capacity-1)
   goals met: 3 of 6
18. (pick-up truck-1 city-3-loc-5 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-3-loc-5) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 3 of 6
19. (drive truck-1 city-3-loc-5 city-3-loc-1)
   deleted: (at truck-1 city-3-loc-5)
   added: (at truck-1 city-3-loc-1)
   goals met: 3 of 6
20. (drop truck-1 city-3-loc-1 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-0)
   added: (at package-1 city-3-loc-1) (capacity truck-1 capacity-1)
   goals met: 4 of 6
21. (drive truck-1 city-3-loc-1 city-3-loc-2)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-3-loc-2)
   goals met: 4 of 6
22. (drop truck-1 city-3-loc-2 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-1)
   added: (at package-3 city-3-loc-2) (capacity truck-1 capacity-2)
   goals met: 5 of 6
23. (drive truck-1 city-3-loc-2 city-1-loc-3)
   deleted: (at truck-1 city-3-loc-2)
   added: (at truck-1 city-1-loc-3)
   goals met: 5 of 6
24. (drive truck-1 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-1)
   goals met: 5 of 6
25. (drive truck-1 city-1-loc-1 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-5)
   goals met: 5 of 6
26. (drop truck-1 city-1-loc-5 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-2)
   added: (at package-2 city-1-loc-5) (capacity truck-1 capacity-3)
   goals met: 6 of 6
